Tekla Open API Reference for Tekla Structures 2025
BaseComponent.GetAttribute Method (String, String)
 Retrieves the attribute with the given name.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetAttribute(
	string AttrName,
	ref string StrValue
)
Public Function GetAttribute (
	AttrName As String,
	ByRef StrValue As String
) As Boolean
Parameters
AttrName
Type: System.String
The name of the attribute.
StrValue
Type: System.String
A string for the return value.
Return Value
Type: Boolean
True if successful.
See Also
Reference
BaseComponent Class
GetAttribute Overload
Tekla.Structures.Model Namespace